// https://blog.csdn.net/u013539952/article/details/80525393

// 傅里叶变换：https://zhuanlan.zhihu.com/p/19759362

// 欧拉公式：https://www.zhihu.com/question/41134540

// 欧拉公式：https://mp.weixin.qq.com/s?__biz=MzU2MTY4NTczNg==&mid=2247483918&idx=1&sn=3c1dd24e8569b5866c028533694098c2&chksm=fc75b789cb023e9f81281b66b65a8575902b9babfe66a1fa08cf9a9806a2dbe5adfc204a7296&scene=21#wechat_redirect

/* 傅里叶级数，时域，频域，相位差，虚数，复数，复平面，欧拉公式 */

/*******************************************************************************************************


    自然指数：e
    定义：e被定义为连续增长系统的极限增量



    虚数：i * i = -1，i叫做虚数。i代表的不是一个数，而是i * i = -1这个定理。在坐标系里，i表示一个旋转量

    复数：一个包含多个维度的信息的数叫做复数（复合的数）
    公式：z = a + bi，复数z里包含了a和b这两个维度的信息，i是一个虚数，i * i = -1。
    理解：把虚数i看成是一个旋转变换，bi表示对b这个数执行了虚数i的变换后的一个数。有个虚数i的变换后，z这个复数就包含了多个维度的信息（比如角度）。


*******************************************************************************************************/

