/*******************************************************************************************************

    正弦三角函数：
    公式：f(x) = sin(x)，其中x是角度，函数值是比值
    定义：锐角三角形里的任意一个锐角的对边和斜边的比值叫做这个锐角的正弦值
    钝角的正弦值等于其补角的正弦值

    正弦曲线函数（又叫正弦波形函数）：
    给定单位圆，对任意角α，使角α的顶点与原点重合，始边与x轴非负半轴重合，终边与单位圆交于点P（u，v），那么点P的纵坐标v叫做角α的正弦函数，记作v=sinα。
    y坐标的值 = sin(角α)，为了方便研究，把角度转成弧度（弧度是一个数值），把角的弧度当做变量x，那么最终公式是 y = sin(x)
    y = sin(x)，其中自变量x是弧度，y是坐标系中的点p的y坐标。
    表示单元圆上某个点的y坐标和弧度的对应关系

*******************************************************************************************************/
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <math.h>

