// https://blog.csdn.net/u013539952/article/details/80525393

// 傅里叶变换：https://zhuanlan.zhihu.com/p/19759362

// 欧拉公式：https://www.zhihu.com/question/41134540

// 欧拉公式：https://mp.weixin.qq.com/s?__biz=MzU2MTY4NTczNg==&mid=2247483918&idx=1&sn=3c1dd24e8569b5866c028533694098c2&chksm=fc75b789cb023e9f81281b66b65a8575902b9babfe66a1fa08cf9a9806a2dbe5adfc204a7296&scene=21#wechat_redirect

// 复数：

/* 傅里叶级数，时域，频域，相位差，虚数，复数，复平面，欧拉公式 */

/*******************************************************************************************************


    自然指数：e
    定义：e被定义为连续增长系统的极限增量



    虚数：i * i = -1，i叫做虚数。i代表的不是一个数，而是i * i = -1这个定理。在坐标系里，i表示一个旋转量

    复数：一个包含多个维度的信息的数叫做复数（复合的数，包含幅值和角度）
    公式：z = a + bi
    理解：i是一个虚数，i * i = -1，在一个横坐标轴上，i * i = -1，表示从(1, 0)点旋转到了(-1, 0)点，也就是旋转了180度，那么一个i就表示旋转90度
        把虚数i看成是一个旋转变换，bi表示进行了b个单位长度的旋转变换，通过这个变换，z就包含了多个维度的信息（角度和幅值），z就成了复数。也可以理解成旋转了b个单位长度
        z不是a和bi直接做加法运算后的值，而是在一个二维的空间内，把一个点先移动到a，然后再移动到bi处的那个点的值
        i * i表示一个点逆时针旋转了18度，一个i就表示旋转90度


*******************************************************************************************************/

